/*
Lection 1 - JavaScript Intro
  1. JS Введение
  2. Подключение скриптов
  3. Именование переменных
  4. Переменные + типы(String, Number),  NaN,
  5. Консоль разработчика
  6. Operators
*/

/*
  # 1. JS Введение
   * LiveScript - JavaScript;
   * JavaScript — это язык программирования, который даёт возможность реализовывать сложное 
     поведение веб-страницы. Является интерпретируемым языком.
   * Интерпретация – это когда исходный код программы получает другой инструмент, который называют «интерпретатор», 
     выполняет его «как есть». При этом распространяется именно сам исходный код (скрипт). 
     Этот подход применяется в браузерах для JavaScript. 
*/

// age = 19.10;
// a = 13;
// b = '123';
// c = 'abc';
// g = b;
// b = 'aaaa';

// console.log(b, a);


// ------------------------/


// a = 1;
// b = 2;
// res = a + b;
// res = a - b;
// res = a * b;
// res = b / a;
// res = b % a;



// -------------------- //

a = 'a123abc';
b = 2;

// res = b * a;

// res = +a;

res = parseInt(a);

console.log(res, 'res');

a = prompt();