/*
Lection 1 - JavaScript Intro
  1. JS Введение
  2. Подключение скриптов
  3. Именование переменных
  4. Переменные + типы(String, Number),  NaN,
  5. Консоль разработчика
  6. Operators
*/

/*
  # 1. JS Введение
   * LiveScript - JavaScript;
   * JavaScript — это язык программирования, который даёт возможность реализовывать сложное 
     поведение веб-страницы. Является интерпретируемым языком.
   * Интерпретация – это когда исходный код программы получает другой инструмент, который называют «интерпретатор», 
     выполняет его «как есть». При этом распространяется именно сам исходный код (скрипт). 
     Этот подход применяется в браузерах для JavaScript. 
*/


// name = 123; // number
// a = "123"; // String a = '123';

// -------------------------------------------

// a = 1; 
// b = 2; 
// c = 0;

// c = a + b;
// // c = '213';

// console.log(c, 'c');

// c = b - a;

// console.log(c, 'c');

// c = b / a;

// console.log(c, 'c');

// c = b * a;

// console.log(c, 'c');


// c = b % a;

// console.log(c, 'c');

//-----------------------------

a = 1; 
b = 'abc'; 
c = 0;
g = '123 Валера';

// c = a + b;
// console.log(c, 'c');


// // c = b - a;
// console.log(c, 'c');

// c = a - b; // a

// console.log(c, 'c');

// g = +g;

g = parseInt(g);


console.log(g, 'g');  

